app/views/pages/list.html.erb

SELECT COUNT(*) FROM `sections` WHERE (`sections`.page_id = 1)
---
      <td class="center"><%= page.visible ? 'Yes' : 'No' %></td>
      <td class="center"><%= page.sections.size %></td>