app/views/pages/list.html.erb

SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC
---
			<td class="centre"><%= subject.visible ? 'Yes' : 'No' %></td>
			<td class="centre"><%= subject.pages.size %></td>