app/controllers/admin_users_controller.rb

INSERT INTO `admin_users` (`username`, `first_name`, `created_at`, `email`, `last_name`, `salt`, `hashed_password`, `updated_at`) VALUES ('testtest', 'Test', '2011-07-30 09:37:48', 'test@test.com', 'Test', 'd340765f8ce66e23f725f78ea9f88a5988b2ea1f', '3d2edbcf3e11c78b80629bd230bd4bfb4480ea9e', '2011-07-30 09:37:48')
---
  def create
    @admin_user = AdminUser.new(params[:admin_user])
    if @admin_user.save

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
---
  def edit
    @admin_user = AdminUser.find(params[:id])

SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 5 LIMIT 1
---
  def delete
    @admin_user = AdminUser.find(params[:id])

DELETE FROM `admin_users` WHERE `admin_users`.`id` = 5
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 5 LIMIT 1
---
  def destroy
    @admin_user = AdminUser.find(params[:id]).destroy