app/controllers/pages_controller.rb

  def create
    @page = Page.new()
    if @page.save
---
INSERT INTO `pages` (`visible`, `updated_at`, `name`, `created_at`, `position`, `permalink`, `subject_id`) VALUES (0, '2011-07-29 04:56:39', NULL, '2011-07-29 04:56:39', NULL, NULL, NULL)

  def list
    @pages = Page.order("pages.position ASC")
---
SELECT `pages`.* FROM `pages` ORDER BY pages.position ASC

  def show
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def edit
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 1 LIMIT 1

  def update
   @page = Page.find(params[:id])
   if @page.update_attributes(params[:page])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1
UPDATE `pages` SET `position` = 1, `permalink` = 'www.dude.com', `name` = 'Dude', `visible` = 1, `subject_id` = 1, `updated_at` = '2011-07-29 06:47:10' WHERE `pages`.`id` = 2

  def delete
    @page = Page.find(params[:id])
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1

  def destroy
    Page.find(params[:id]).destroy
---
DELETE FROM `pages` WHERE `pages`.`id` = 3
SELECT `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1