app/controllers/sections_controller.rb

SELECT `sections`.* FROM `sections` ORDER BY sections.position ASC
---
  def list
    @sections = Section.order("sections.position ASC")

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def show
    @section = Section.find(params[:id])

INSERT INTO `sections` (`page_id`, `visible`, `content`, `updated_at`, `name`, `content_type`, `created_at`, `position`) VALUES (3, 1, 'shhhhutup', '2011-07-29 06:48:01', 'shhh', 'shutup', '2011-07-29 06:48:01', 1)
---
  def create
    @section = Section.new(params[:section])
    if @section.save

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1
---
  def edit
    @section = Section.find(params[:id])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 3 LIMIT 1
UPDATE `sections` SET `position` = 2, `updated_at` = '2011-07-29 06:58:02' WHERE `sections`.`id` = 4
---
  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(params[:section])

SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def delete
    @section = Section.find(params[:id])

DELETE FROM `sections` WHERE `sections`.`id` = 1
SELECT `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
---
  def destroy
    Section.find(params[:id]).destroy