app/controllers/subjects_controller.rb

  def list
    @subjects = Subject.order("subjects.position ASC")
---
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

  def create
    @subject = Subject.new(params[:subject])
    if @subject.save
---
INSERT INTO `subjects` (`updated_at`, `name`, `created_at`, `visible`, `position`) VALUES ('2011-07-22 23:58:14', 'Flash Test', '2011-07-22 23:58:14', 0, NULL)

  def edit
    @subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1

  def update
    @subject = Subject.find(params[:id])
    if @subject.update_attributes(params[:subject])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
UPDATE `subjects` SET `name` = 'Initial.. Subject', `updated_at` = '2011-07-26 10:05:15' WHERE `subjects`.`id` = 1

  def destroy
    Subject.find(params[:id]).destroy
---
DELETE FROM `subjects` WHERE `subjects`.`id` = 7
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 7 LIMIT 1